In [3]:
import pandas as pd
df = pd.read_csv(r"D:\University\IMT\Python Codes\employees.csv")
df

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30
5   6      Eva Green         HR   41   54000   2017-04-22
6   7     Mike Davis    Finance   50   90000   2016-08-19
7   8   Linda Taylor         IT   26   64000   2022-02-10
8   9   James Wilson  Marketing   38   70000   2020-09-08
9  10    Sarah Adams         HR   30   55000   2021-03-18

In [4]:
print(df.head())

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30

In [6]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 612.0+ bytes
None

In [5]:
print(df.describe())

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  35.300000  68300.000000
std     3.02765   7.958922  13106.826042
min     1.00000  26.000000  50000.000000
25%     3.25000  29.250000  57250.000000
50%     5.50000  33.000000  69000.000000
75%     7.75000  40.250000  74250.000000
max    10.00000  50.000000  90000.000000

In [7]:
employee = df[df['Department'] == 'IT']

In [8]:
print(employee)

   ID          Name Department  Age  Salary Joining_Date
1   2    Jane Smith         IT   34   75000   2019-06-12
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10

In [9]:
count = df.groupby('Department').size()

In [10]:
print(count)

Department
Finance      2
HR           3
IT           3
Marketing    2
dtype: int64

In [13]:
average_salary_by_department = df.groupby('Department')['Salary'].mean()

print(average_salary_by_department)

Department
Finance      87500.000000
HR           53000.000000
IT           70333.333333
Marketing    69000.000000
Name: Salary, dtype: float64

In [17]:
df['Increased_Salary'] = df['Salary'] * 0.05 + df['Salary']

In [18]:
df

   ID           Name Department  Age  Salary Joining_Date  Increased_Salary
0   1       John Doe         HR   28   50000   2020-05-21           52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12           78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15           89250.0
3   4    Alice White         IT   29   72000   2021-01-04           75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30           71400.0
5   6      Eva Green         HR   41   54000   2017-04-22           56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19           94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10           67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08           73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18           57750.0

In [23]:
df.sort_values('Age', ascending=False, inplace=True)

In [22]:
df

   ID           Name Department  Age  Salary Joining_Date  Increased_Salary
6   7     Mike Davis    Finance   50   90000   2016-08-19           94500.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15           89250.0
5   6      Eva Green         HR   41   54000   2017-04-22           56700.0
8   9   James Wilson  Marketing   38   70000   2020-09-08           73500.0
1   2     Jane Smith         IT   34   75000   2019-06-12           78750.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30           71400.0
9  10    Sarah Adams         HR   30   55000   2021-03-18           57750.0
3   4    Alice White         IT   29   72000   2021-01-04           75600.0
0   1       John Doe         HR   28   50000   2020-05-21           52500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10           67200.0

In [24]:
df.value_counts('Department')

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

In [25]:
df['Joining_Date'] = pd.to_datetime(df['Joining_Date'])


joined_after_2020 = df[df['Joining_Date'] > pd.Timestamp('2020-01-01')]


print(joined_after_2020)

   ID          Name Department  Age  Salary Joining_Date  Increased_Salary
8   9  James Wilson  Marketing   38   70000   2020-09-08           73500.0
9  10   Sarah Adams         HR   30   55000   2021-03-18           57750.0
3   4   Alice White         IT   29   72000   2021-01-04           75600.0
0   1      John Doe         HR   28   50000   2020-05-21           52500.0
7   8  Linda Taylor         IT   26   64000   2022-02-10           67200.0

In [27]:
joined_after_2020.to_csv(r"D:\University\IMT\Python Codes\recent_joins.csv", index=False)